app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    if params[:search]
      @posts = Post.search(params[:search]) + Post.search_by_user(params[:search])

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "aaa"], ["user_id", 2], ["created_at", "2015-12-06 21:57:37.630020"], ["updated_at", "2015-12-06 21:57:37.630020"]]
---
  def create
    @posts = Post.all.order(:updated_at)
    @user = current_user
    @post = Post.new(post_params)
    @comment = Comment.new

    @post.user_id = current_user.id

    if image = params[:post][:image]
      @post.gallery_image_id = GalleryImage.create(photo: image).id

UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "aaaa"], ["updated_at", "2015-12-06 21:58:15.713568"], ["id", 1]]
---
  def update
    @posts = Post.all.order(:updated_at)
    @user = current_user

    respond_to do |format|
      if @post.update(post_params)