app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (full_name ILIKE '%a@a.cz%' OR email ILIKE '%a@a.cz%')  ORDER BY created_at DESC
---
  def index
    @user = current_user

    if params[:search_user]
      @users = User.where.not(id: current_user.id).search(params[:search_user]).order(created_at: :desc)